# Student Alcohol Consumption

### Introduction:

This time you will download a dataset from the UCI.

### Step 1. Import the necessary libraries

In [19]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv).

### Step 3. Assign it to a variable called df.

In [20]:
df = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv')
df.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,6,5,6,6
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,4,5,5,6
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,10,7,8,10
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,2,15,14,15
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,4,6,10,10

### Step 4. For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column

In [21]:
df_new = df.loc[:, 'school':'guardian']
df_new.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,course,mother
1,GP,F,17,U,GT3,T,1,1,at_home,other,course,father
2,GP,F,15,U,LE3,T,1,1,at_home,other,other,mother
3,GP,F,15,U,GT3,T,4,2,health,services,home,mother
4,GP,F,16,U,GT3,T,3,3,other,other,home,father

### Step 5. Create a lambda function that will capitalize strings.

In [22]:
capitalizer = lambda x: x.capitalize()

### Step 6. Capitalize both Mjob and Fjob

In [23]:
df_new['MjobCap']= df_new.Mjob.apply(capitalizer)
df_new['FjobCap']= df_new.Fjob.apply(capitalizer)
df_new.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,MjobCap,FjobCap
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,course,mother,At_home,Teacher
1,GP,F,17,U,GT3,T,1,1,at_home,other,course,father,At_home,Other
2,GP,F,15,U,LE3,T,1,1,at_home,other,other,mother,At_home,Other
3,GP,F,15,U,GT3,T,4,2,health,services,home,mother,Health,Services
4,GP,F,16,U,GT3,T,3,3,other,other,home,father,Other,Other

In [24]:
df_new.FjobCap

0       Teacher
1         Other
2         Other
3      Services
4         Other
         ...
390    Services
391    Services
392       Other
393       Other
394     At_home
Name: FjobCap, Length: 395, dtype: object

### Step 7. Print the last elements of the data set.

In [25]:
df_new.tail()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian,MjobCap,FjobCap
390,MS,M,20,U,LE3,A,2,2,services,services,course,other,Services,Services
391,MS,M,17,U,LE3,T,3,1,services,services,course,mother,Services,Services
392,MS,M,21,R,GT3,T,1,1,other,other,course,other,Other,Other
393,MS,M,18,R,LE3,T,3,2,services,other,course,mother,Services,Other
394,MS,M,19,U,LE3,T,1,1,other,at_home,course,father,Other,At_home

### Step 8. Did you notice the original dataframe is still lowercase? Why is that? Fix it and capitalize Mjob and Fjob.

In [26]:
df_cap = df_new.drop(columns=['Mjob', 'Fjob'])
df_cap.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,reason,guardian,MjobCap,FjobCap
0,GP,F,18,U,GT3,A,4,4,course,mother,At_home,Teacher
1,GP,F,17,U,GT3,T,1,1,course,father,At_home,Other
2,GP,F,15,U,LE3,T,1,1,other,mother,At_home,Other
3,GP,F,15,U,GT3,T,4,2,home,mother,Health,Services
4,GP,F,16,U,GT3,T,3,3,home,father,Other,Other

### Step 9. Create a function called majority that returns a boolean value to a new column called legal_drinker (Consider majority as older than 17 years old)

In [9]:
def majority(x):
    if x > 17:
        return True
    else:
        return False

In [10]:
df_cap['legal_drinker']= df_cap.age.apply(majority)
df_cap.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,reason,guardian,MjobCap,FjobCap,legal_drinker
0,GP,F,18,U,GT3,A,4,4,course,mother,At_home,Teacher,True
1,GP,F,17,U,GT3,T,1,1,course,father,At_home,Other,False
2,GP,F,15,U,LE3,T,1,1,other,mother,At_home,Other,False
3,GP,F,15,U,GT3,T,4,2,home,mother,Health,Services,False
4,GP,F,16,U,GT3,T,3,3,home,father,Other,Other,False

### Step 10. Multiply every number of the dataset by 10. 
##### I know this makes no sense, don't forget it is just an exercise

En este caso hemos utilizado otro metodo que es applymap()
- Ref.: https://www.geeksforgeeks.org/python-pandas-dataframe-applymap/

Map( ), Apply( ), Applymap( ) With the Lambda Function

- Ref.: https://medium.com/@evelynli_30748/map-apply-applymap-with-the-lambda-function-5e83028be759

In [27]:
def multiply(x):
    if type(x) is int or type(x) is float:
        return x * 10
    return x

df_multiplied = df_cap.applymap(multiply)
df_multiplied

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,reason,guardian,MjobCap,FjobCap
0,GP,F,180,U,GT3,A,40,40,course,mother,At_home,Teacher
1,GP,F,170,U,GT3,T,10,10,course,father,At_home,Other
2,GP,F,150,U,LE3,T,10,10,other,mother,At_home,Other
3,GP,F,150,U,GT3,T,40,20,home,mother,Health,Services
4,GP,F,160,U,GT3,T,30,30,home,father,Other,Other
...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,200,U,LE3,A,20,20,course,other,Services,Services
391,MS,M,170,U,LE3,T,30,10,course,mother,Services,Services
392,MS,M,210,R,GT3,T,10,10,course,other,Other,Other
393,MS,M,180,R,LE3,T,30,20,course,mother,Services,Other
394,MS,M,190,U,LE3,T,10,10,course,father,Other,At_home

In [12]:
df_multiplied2 = df_cap.select_dtypes(include=[np.number]) * 10
df_multiplied2.head()

   age  Medu  Fedu
0  180    40    40
1  170    10    10
2  150    10    10
3  150    40    20
4  160    30    30